package com.Alexander.day3;

public class bitoperators {
    public static void main(String[] args)
    {
        //位运算符
        //& 按位与 两位全为1，结果为1，否则为0
        //| 按位或 两位有一个为1，结果为1，否则为0
        //^ 按位异或 两位一个为0，一个为1，结果为1，否则为0
        //~ 按位取反 0变1，1变0
        //>> 算术右移 低位溢出，符号位不变，用符号位补溢出的高位->本质除2
        //<< 算术左移 符号位不变，低位补->本质乘2
        //>>> 逻辑右移/无符号右移 低位溢出，高位补0
        //计算机按补码运算，看结果为原码
        //符号位0是正数，1是负数
        //正数的原码，补码，反码相同
        //负数的反码 = 符号位不变，其他位取反 / 反码 = 补码 - 1
        //负数的补码 = 反码 + 1
        System.out.println(2&3);
        //2的原码，补码：00000000 00000000 00000000 00000010
        //3的原码,补码：00000000 00000000 00000000 00000011
        //运算后：00000000 00000000 00000000 00000010
        System.out.println(~-2);
        //-2原码：10000000 00000000 00000000 00000010
        //-2反码：11111111 11111111 11111111 11111101
        //-2补码：11111111 11111111 11111111 11111110
        //运算后补码：00000000 00000000 00000000 00000001  为正数->补码，反码，原码相同->结果为1
        System.out.println(~2);
        //2的原码，补码：00000000 00000000 00000000 00000010
        //运算后补码：11111111 11111111 11111111 11111101
        //原码:10000000 00000000 00000000 00000011
        int a = 1 >> 2;
        System.out.println(a);
        //00000000 00000000 00000000 00000001 -> 00000000 00000000 00000000 00000000
        int b = 1 << 2;
        System.out.println(b);
        //00000000 00000000 00000000 00000001 -> 00000000 00000000 00000000 00000100
    }
}
